# 1、随便定义一个分数，学生成绩分等级：90以上（显示优秀），80~89（显示良好），70~80（显示还行），60~70（显示及格），60以下（显示不及格）。
# a=int(input("请输入分数:"))
# if 100>=a>=90:
#     print("成绩优秀")
# elif 90>a>=80:
#     print("成绩良好")
# elif 80>a>=70:
#     print("成绩还行")
# elif 70>a>=60:
#     print("成绩及格")
# elif a<60:
#     print("成绩不及格,加油吧少年! 奥利给!!!")
# else:
#     print("请输入正确成绩!!!")


# # 2、三角形形状判断：
# # 1）定义三个变量表示三角形的三个边长
# a=4
# b=4  
# c=4 
# # 2）通过边长进行判断三角形的形状。
# if a+b<c or b+c<a or c+a<b:
#     print("边长不能组成三角形")
# # 3）如果能组成三角形：
# # 是等边三角形；
# elif a==b==c:
#     print("这是一个等边三角形")
# # 是等腰三角形；
# elif a==b!=c or b==c!=a or c==a!=b:
#     print("这是一个等腰三角形")
# # 是直角三角形；
# elif a^2+b^2==c^2 or b^2+c^2==a^2 or c^2+a^2==b^2: 
#     print("这是一个直角三角形")
# # 是钝角三角形；
# elif a^2+b^2<c^2 or b^2+c^2<a^2 or c^2+a^2<b^2:
#     print("这是一个钝角三角形")
# # 是锐角三角形；
# elif a^2+b^2>c^2 or b^2+c^2>a^2 or c^2+a^2>b^2:
#     print("这是一个锐角三角形")
# # 4）如果边长不能组成三角形，要输出：边长不能组成三角形。






# 3、判断一个年份（1~2000之间）是不是闰年。
# a=int(input("请输入一个年份:"))
# if 1<a<=2000:
#     if a%4==0 and a%400==0:
#         print("这是一个闰年!")
#     elif a%4==0 and a%100!=0:
#         print("这是一个闰年!")
#     else:
#         print("这是一个平年!")
# else:
#     print("请输入规定年份!!!")

# 4、对于一个月份（1~12），输出这个月份有多少天。
# a=int(input("请输入一个月份:"))
# if 12>=a>=1:
#     if a==1 or a==3 or a==5 or a==7 or a==8 or a==10 or a==12:
#         print("这个月有31天呦!!")
#     else:
#         print("这个月有30天呦!!")
# else:
#     print("请输入正确的月份!!!")






# # 5、一个整数，判断是奇数还是偶数。

# a=int(input("请输入一个整数:"))
# if a%2==0:
#     print("%s :是一个偶数"%(a))
# else:
#     print("%s :是一个基数"%(a))


# 6、一个一元二次方式ax²+bx+c=0.判断这个一元二次方程有没有解。
# for a in range(10):
#     for x in range(10):
#         for b in range(10):
#             for c in range(10):
#                 if a*x^2+b*x+c==0:
                     
#                     print("这个结果有解!:a=%s,x=%s,b=%s,c=%s"%(a,x,b,c))


    
# 7、对确定的年月日三个数值，判断这个日期是这一年的第几天。
# n=int(input("请输入一个年:"))
# y=int(input("请输入一个月份:"))
# r=int(input("请输入一个日期:"))
# a=[31,28,31,30,31,30,31,31,30,31,30,31]
# if (n%4==0 or n%100!=0) and n%400==0:
#     a[1]=29
# if 1>y>12:
#     print("请输入正确月份")
# if 1>r>31:
#     print("请输入正确日期")
# b=0
# for i in range(y-1):
#     b=b+a[i]
# print(b+r)
    
    
    














# 方法1
# nian=int(input("请输入一个年份"))
# yue=int(input("请输入一个月份"))
# ri=int(input("请输入一个日期"))
# b=[31,28,31,30,31,30,31,31,30,31,30,31]
# if (nian%4==0 or nian%100!=0) and nian%400==0:
#     b[1]=29
# else:
#     b[1]=28
# if 1>ri>31:
#     print("请输入正确日期!!")
# a=0  
# for i in range(1, 13):
#     if i == yue:
#         for j in range(i-1):
#             a = a+b[j]
#         print("这是这个年第%s天"%(a+ri))

# # 方法2
# nian=int(input("请输入一个年份"))
# yue=int(input("请输入一个月份"))
# ri=int(input("请输入一个日期"))
# b=[31,28,31,30,31,30,31,31,30,31,30,31]
# if (nian%4==0 or nian%100!=0) and nian%400==0:
#     b[1]=29
# else:
#     b[1]=28
# if 1>ri>31:
#     print("请输入正确日期!!")
# if yue==1:
#     print("这是这年的第%s天"%(ri))    
# elif yue==2:
#     print("这是这年的第%s天"%(b[0]+ri))
# elif yue==3:
#     print("这是这年的第%s天"%(b[0]+b[1]+ri))
# elif yue==4:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+ri))
# elif yue==5:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+ri))
# elif yue==6:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+ri))
# elif yue==7:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+ri))
# elif yue==8:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+ri))
# elif yue==9:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+b[7]+ri))
# elif yue==10:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+b[7]+b[8]+ri))
# elif yue==11:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+b[7]+b[8]+b[9]+ri))
# elif yue==12:
#     print("这是这年的第%s天"%(b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+b[7]+b[8]+b[9]+b[10]+ri))
# else:
#     print("请输入正确的月份!!")







# 8、题目:企业发放的奖金根据利润提成。利润低于或等于10万元时，奖金可提10%;
# a=12
# jj=0
# if a<=10:
#     jj=a*0.1
#     print("奖金是:%s万元"%(jj))
# # 利润高于10万元，低于20万元时,低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%;
# elif 20>=a>10:
#     jj=((a-10)*0.075)+1
#     print("奖金是:%s万元"%(jj))
# # 20万到40万之间时，高于20万元的部分，可提成5%,
# elif 40>=a>20:
#     jj=((a-20)*0.05)+1.75
#     print("奖金是:%s万元"%(jj))
# # 40万到60万之间时高于40万元旳部分,可提成3%;
# elif 60>=a>40:
#     jj=((a-40)*0.03)+2.75
#     print("奖金是:%s万元"%(jj))
# # 60万到100万之间时，高于60万元的部分，可提成1.5%；
# elif 100>=a>60:
#     jj=((a-60)*0.015)+3.35
#     print("奖金是:%s万元"%(jj))
# # 高于100万元时、超讨100万元的部分按1%提成。
# elif a>100:
#     jj=((a-100)*0.01)+3.95
#     print("奖金是:%s万元"%(jj))
# # 输入当月利润l，求应发放奖金总数。



    




