'''
    字典：dict
        是无序的，不能切片、不能索引，不能重复（部分不重复-键）、值是可以修改的。
        是属于容器类型，映射类型（元素是以键值对的方式存在）
    定义：
        {}来定义，元素以键：值的形式存在
        如果你确定键值对，则使用：
        dict2 = {"文章":"姚笛","黄晓明":"杨颖","邓超":"孙俪","文章":"马伊利"}
        如果只知道键，不确定键所对应的值
        dict3 = {}.fromkeys(["a","v","d"])
        dict3["a"]=3
        dict3["aa"]=44

'''
# {}来定义一个空的字典
dict1={}
print(type(dict1))

# 以键值对给元素数据
dict2 = {"文章":"姚笛","黄晓明":"杨颖","邓超":"孙俪","文章":"马伊利"}
print(dict2)

# 获取字典中的数据，通过键名称来获取对应的值
print(dict2["黄晓明"])
# 修改指定键的值
dict2["黄晓明"]="angla baby"
print(dict2)

# 通过列表转化为字典
# list1 = [("a",1),("b",2),("c",3)]
list1 = [["a",1],["b",2],["c",3]]
# dict是工厂类方法，list()、str()、int()
dict3 = dict(list1)
# {'a': 1, 'b': 2, 'c': 3}
print(dict3)

# fromKeys():{'a': None, 'b': None, 'c': None}
# 快速生成一个有默认值的字典，至于字典的实际值定义可以不确定，后续需要的时候再修改
# dict4 = dict1.fromkeys(['a','b','c'],1)
# print(dict4)


# dict5 = dict(zip(("a","b","c"),(1,2,3)))
# print(dict5)

# dict6 = dict(zip(["a","b","c"],[5,6,7]))
# print(dict6)